---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.ConduitSettings
source: html/d640f8ec-a792-ddce-dd73-59e37e420145.htm
---
# ConduitSettings Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.